app/views/profiles/showForUser.html.erb

<ul>
  <% @user.profiles.each do |profile| %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ?  [["user_id", 4]]