app/views/users/show.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ?  [["user_id", 4]]
---
    <h4>Twoje profile: </h4>
      <% @user.profiles.each do |profile| %>