app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "bzdura"], ["LIMIT", 1]]
---
  def authenticate_token
    authenticate_with_http_token do |token, options|
      @current_user ||= User.find_by(token: token)