app/helpers/users_helper.rb

  def current_profile
    prof_id = current_user.current_profile_id
    @current_profile ||= Profile.find_by(id: prof_id)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]