app/views/static/feed.html.erb

<div class="feed-grid">
  <% Post.find_each do |post| %>
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1000]]

      profileId = post.profile_id
      profile = Profile.find_by(id: profileId)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]