app/views/static/index.html.erb

  <h2>Twoje posty</h2>
  <% current_user.profiles.each do |profile| %>
    <%= profile.name %><br>
    <% profile.posts.each do |post| %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ?  [["user_id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."profile_id" = ?  [["profile_id", 4]]