app/views/posts/show.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  profileId = @post.profile_id
  Profile.find_by(:id => profileId).name

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]
---
<div class="comments-block">
  <% @post.comments.each do |comment| %>

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
          profileId = comment.profile_id
          Profile.find_by(:id => profileId).name