app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "comment_date", "comment_time", "profile_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.new(comment_params)
    post = Post.find_by(id: @comment.post_id)

    respond_to do |format|
      if @comment.save