app/controllers/comments_controller.rb

  def create

    comment_params[:post_id] = params[:id]

    @comment = Comment.new(comment_params)
    post = Post.find_by(id: params[:id])
    if post != nil
      @comment.post_id = post.id
    end
    profile = Profile.find_by(id: @comment.profile_id)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]