app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

     profile = Profile.find_by(id: post_params[:profile_id])
     user = User.find_by(id: params[:id])

    if user == current_user && profile.in?(current_user.profiles)
      respond_to do |format|
        if @post.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "post_date", "post_group", "title", "profile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["content", "test"], ["post_date", "2021-12-25"], ["post_group", "a"], ["title", "a"], ["profile_id", 5], ["created_at", "2021-12-25 22:23:13.834055"], ["updated_at", "2021-12-25 22:23:13.834055"]]

    def set_post
      #@post = Post.find(params[:id])
      if Post.find_by(id: params[:id]) != nil
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]