app/controllers/profiles_controller.rb

  def showForUser
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "picture", "desc", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test_pawel"], ["picture", ""], ["desc", "testpawel"], ["user_id", 9], ["created_at", "2021-12-26 16:09:45.069265"], ["updated_at", "2021-12-26 16:09:45.069265"]]