app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_index" = ? LIMIT ?  [["user_index", "253417"], ["LIMIT", 1]]
---
  def create
    respond_to do |format|

      user = User.find_by(user_index: params[:session][:user_index])