app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "current_profile_id" = ? WHERE "users"."id" = ?  [["updated_at", "2021-12-25 12:07:02.943593"], ["current_profile_id", 4], ["id", 4]]
---
  def setProfile
    @user = User.find_by(id: params[:id])
    @user.current_profile_id = params[:current_profile_id]
    @user.save(validate: false)

INSERT INTO "users" ("name", "last_name", "user_type", "user_index", "created_at", "updated_at", "password_digest", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2021-12-25 12:17:10.837948"], ["password_digest", "$2a$12$fR1RnU7eTx1XwL9jTAsh3.UVv7WY/UTfVLxaOxRZfc.6rKisUE/du"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE (4) LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_user
      if !User.exists?(params[:id])
        render_not_found
      else
        @user = User.find(params[:id])