app/models/user.rb

UPDATE "users" SET "token" = ? WHERE "users"."id" = ?  [["token", nil], ["id", 4]]
---
  def invalidate_token
    self.update_columns(token: nil)